[
  {
    "index": 1,
    "title": "向伟大的抗癌斗士致敬",
    "type": "联盟致敬",
    "passage": "近期，我们得知了一个不幸的消息，我们的联盟管理员之一————“LingChen凌辰”在早些时候患上了胃癌，且目前已发展至晚期\n\n对于她的不幸遭遇我们深表同情与关心，目前她在进行了一段时间的化疗后，病情仍然未见好转，反而更加严重，她本人也已开始接受进一步治疗\n\n这是一个相当漫长痛苦且耗费金钱的过程，但尽管如此，她却并不畏病魔，顽强地与其斗争，并展现出了常人所难以表现的强大乐观心态\n\n联盟想对你说的是：\n\n凌辰，你不是在一个人孤身奋战，也请不要过于担心病痛的折磨。虽然我们因互联网的限制而远隔千里，甚至素未谋面，但我们永远会支持你，如果你有任何需要，我们也将尽自己最大所能为你提供援助，并号召外界一同来帮助你 对抗病魔。一切都会好起来的，黑暗的尽头必然是明亮的曙光，凡是杀不死你的，必将让你变得更加强大！\n\n加油，凌辰！且听那千百余人在为你呐喊助威，我们与你同在，小小疾病又怎会击垮你顽强的意志！我们相信你一定能好起来的！！ 我们等你凯旋归来，彼时我们将欢声笑语，共同畅谈，重新回到你在联盟的那段美好时光！\n\n死神，你莫骄傲，尽管有人将你看得\n\n如何强大，如何可怖，你呀，名不符实;\n\n你自以为已经把芸芸众生毁灭，\n\n可怜的死神，他们没死，你至今还杀不死我;\n\n休憩和睡眠，其实就是你的写照，\n\n你是命运，时机，君主和狂徒的奴隶，\n\n你与毒药，战争和病魔同流合污，\n\n鸦片与巫术也能灵验地进行蛊惑，\n\n而且效果更佳，你又何必颐指气使?\n\n　人们小憩一会，精神便得以永远清朗，\n\n　便再不会有死亡，死神你自己将死亡。\n\n————《神圣十四行诗》\n\n最后，谨代表捏嘿嘿，我想送你一首歌，希望它能陪伴你战胜病魔，并使你振作起来！加油，凌辰，我们相信你！！\n\n点此播放\nif you live for somethin'\n如果你活的有所理想\n\nYou're not alone my friend\n你就不会孤独，朋友\n\nSo fill up your cup and lift your lighter\n所以通过苦难磨练你自己吧，高举火把\n\nA toast to life\n为了生活干杯\n\nThey say what don't kill me can make me stronger\n他们说杀我不死，令我更强\n\nSo two drinks a night should help me live longer\n所以一夜喝两杯酒会帮我长寿\n\nI blow some smoke to give my lungs a test\n我吸烟仅仅是为了锻炼我的肺\n\nBecause why tip-toe through life to arrive safely at death\n为什么一生要小心翼翼，为了得以善终吗\n\nI'm on a journey yeah I'm on a roll\n我充满渴望，我势如破竹\n\nSometimes I gotta close my eyes just to open my soul\n有时我闭上双眼，敞开我的魂魄\n\nAnd tonight is the night I gotta feeling I'm about to act a fool\n今晚是时候了，我会细细品味扮演一位愚人\n\nSo if you go fix some drinks me and Usher 'bout to break some rules\n所以如果你为我调一杯饮料Usher我便会干点出格的趣事\n\nThat's somewhere and gone but the world is moving slow\n目的地很明确但世界在不断运动\n\nI was born for the fast life\n我的人生生来完美\n\nI go for broke a lesson I can't afford\n我追求一切不会在此堕落\n\nBut for what it's worth I'm ready to pay\n但是为了更加有意义我已经准备好继续进行\n\nFor the rest of my life\n我的余生\n\nFor the rest of my life\n我的余生\n\nIf I got one life to live I'mma party 'til I'm dead\n如果我能度过一生，我会将聚会进行到底\n\nWhat the hell is a life worth living if it's not on the edge\n如果生活不处于叛逆的边缘活着有什么意思\n\nTrying to keep my balance I'm twisted so just in case I fall\n试着维持劳逸结合，我之所以舞动是为了防止沦落\n\nWritten on my tombstone should say \"Women W**d and Alcohol\"\n在我的墓碑上刻下，女人在抽烟喝酒方面赢了\n\nThat's somewhere and gone but the world is moving slow\n目的地很明确但世界在不断运动\n\nI was born for the fast life\n我的人生生来完美\n\nI go for broke a lesson I can't afford\n我追求一切不会在此堕落\n\nBut for what it's worth I'm ready to pay\n但是为了更加有意义我已经准备好继续进行\n\nFor the rest of my life\n我的余生\n\nFor the rest of my life\n我的余生\n\nIf you live for somethin'\n如果你活的有所理想\n\nYou're not alone my friend\n你就不会孤独，朋友\n\nSo fill up your cup and lift your lighter\n所以通过苦难磨练你自己吧，高举火把\n\nA toast to life\n为了生活干杯\n\nI'm stuck in this moment freeze the hands of time\n我在此刻沉沦，定格忙碌的生活节奏\n\nCause I feel inner peace when I'm out of my mind\n因为我在神游天外时能感受到内心的平静\n\nAnd you can call me crazy but I like to roll the dice\n你可以把我当做疯子但我喜欢掌握自己的命运之骰\n\nSo I'm willing to bet that I'mma be crazy for the rest of my life\n所以我祈求我会在余生疯狂一把，我的余生\n\nFor the rest of my life\n我的余生\n\nFor the rest of my life\n我的余生",
    "path": "/LingChenJiaYou"
  },
  {
    "index": 2,
    "type": "监狱建筑师——游戏攻略",
    "title": "“无供应”问题解决方法",
    "passage": "如图，你可能在游玩时遇到过以下问题\n\n\n\"这个监牢不可以访问食堂\"\n\n＂没有任何囚犯被分配在这个食堂吃饭＂\n通常情况下，造成此类问题的原因是食堂与厨房/牢房的供应链接断开，如果你依次点击菜单中的＂后勤＂，供应后，你会发现如下情况\n\n\n未链接的餐厅\n如图，所有食堂与监区的链接线都消失了，代表此时食堂并没有向任何一个牢房供餐，食堂没有正常工作 此时，请点击“食物分配”，再点击绿色叉子图标后选择“链接”，再点击对应监区来建立食堂对该监区的食物供应\n\n\n如图所示，出现红线即代表连接正确\n再重复此操作，直到将食堂与所有监区建立食物供应，此时问题即可解决",
    "path": "/Prison/Tips/1"
  },
  {
    "index": 3,
    "type": "关于我们",
    "title": "关于我们",
    "passage": "UGCC联盟，致力于服务玩家与各游戏一线开发者，下滑以继续，我们所涉及的游戏：监狱建筑师Prison Architect112接线员112 Operator世界征服者World Conqueror ROBLOX开源共建共享UGCC开源计划我们坚信，开源与共享将是未来各游戏圈子的发展方向，也是促进技术交流与发展的最佳方式。因此，我们将逐步开放由UGCC联盟开发的安装器、工具等项目的源代码，并承诺所有玩家均可无偿使用我们提供的服务，亦或是对其进行修改。开发团队及贡献者\n捏嘿嘿\n溪辰\n狐幽鸣酱\n加入我们\n百闻不如一见，我们正需要你这样热爱游戏与技术的玩家。无论你是萌新亦或大佬，这里都必然有你的用武之地。又或许你只想要解答自己心中埋藏已久的游戏问题，当然可以！我们随时欢迎您的到来！\n监狱建筑师交流群总群丨UGCC\n联盟总群,众多模组的首发地及全联盟最大的玩家交流群\n提取出所有中文监狱建筑师交流群 二群丨UGCC\n联盟二群,拥有热情的玩家以及技术经验丰富的众多大佬监狱建筑师交流群 三群丨UGCC\n联盟三群，萌新玩家聚集地，欢迎前来交流心得监狱建筑师交流群 新特区丨UGCC\n联盟近期加入成员群，管理制度独具特色，成员活跃监狱建筑师交流群 新特区二群丨UGCC\n联盟直属管辖群，技术交流频繁，氛围良好",
    "path": "/About"
  },
  {
    "index": 4,
    "type": "监狱建筑师——游戏攻略",
    "title": "玩忽职守",
    "passage": "当发生大规模暴动或伤亡事件导致局面失去控制时，您将会收到来自首席执行官（CEO）的致电，并收到最后通牒。\n\n\n大规模暴动触发条件\n监狱内伤亡人数过多\n负债过高\n如果您未能在规定时间内控制局势，那么州政府将会介入。其将派遣一支国民警卫队前往您的监狱并对所有正在执行违规行为的囚犯进行无差别射杀\n\n\n州政府的国民警卫队\n您将被判处“玩忽职守”罪并被送上囚车，然后在监牢中度过余生。如果您是电脑版玩家，那么您将有机会体验一次逃出自己亲手建造的监狱！（逃脱模式被强制启动）\n\n解决方法\n在规定时间内完成CEO的要求\n在游戏开始前取消勾选“失败条件”\n避免大规模暴动、瘟疫和负债过多\n在官僚科技树中研究法律辩护(一次性)",
    "path": "/Prison/Tips/WanHuZhiShou"
  }
]