[
  {
    "index": 1,
    "title": "向伟大的抗癌斗士致敬",
    "type": "联盟致敬",
    "passage": "近期，我们得知了一个不幸的消息，我们的联盟管理员之一————“LingChen凌辰”在早些时候患上了胃癌，且目前已发展至晚期\n\n对于她的不幸遭遇我们深表同情与关心，目前她在进行了一段时间的化疗后，病情仍然未见好转，反而更加严重，她本人也已开始接受进一步治疗\n\n这是一个相当漫长痛苦且耗费金钱的过程，但尽管如此，她却并不畏病魔，顽强地与其斗争，并展现出了常人所难以表现的强大乐观心态\n\n联盟想对你说的是：\n\n凌辰，你不是在一个人孤身奋战，也请不要过于担心病痛的折磨。虽然我们因互联网的限制而远隔千里，甚至素未谋面，但我们永远会支持你，如果你有任何需要，我们也将尽自己最大所能为你提供援助，并号召外界一同来帮助你 对抗病魔。一切都会好起来的，黑暗的尽头必然是明亮的曙光，凡是杀不死你的，必将让你变得更加强大！\n\n加油，凌辰！且听那千百余人在为你呐喊助威，我们与你同在，小小疾病又怎会击垮你顽强的意志！我们相信你一定能好起来的！！ 我们等你凯旋归来，彼时我们将欢声笑语，共同畅谈，重新回到你在联盟的那段美好时光！\n\n死神，你莫骄傲，尽管有人将你看得\n\n如何强大，如何可怖，你呀，名不符实;\n\n你自以为已经把芸芸众生毁灭，\n\n可怜的死神，他们没死，你至今还杀不死我;\n\n休憩和睡眠，其实就是你的写照，\n\n你是命运，时机，君主和狂徒的奴隶，\n\n你与毒药，战争和病魔同流合污，\n\n鸦片与巫术也能灵验地进行蛊惑，\n\n而且效果更佳，你又何必颐指气使?\n\n　人们小憩一会，精神便得以永远清朗，\n\n　便再不会有死亡，死神你自己将死亡。\n\n————《神圣十四行诗》\n\n最后，谨代表捏嘿嘿，我想送你一首歌，希望它能陪伴你战胜病魔，并使你振作起来！加油，凌辰，我们相信你！！\n\n点此播放\nif you live for somethin'\n如果你活的有所理想\n\nYou're not alone my friend\n你就不会孤独，朋友\n\nSo fill up your cup and lift your lighter\n所以通过苦难磨练你自己吧，高举火把\n\nA toast to life\n为了生活干杯\n\nThey say what don't kill me can make me stronger\n他们说杀我不死，令我更强\n\nSo two drinks a night should help me live longer\n所以一夜喝两杯酒会帮我长寿\n\nI blow some smoke to give my lungs a test\n我吸烟仅仅是为了锻炼我的肺\n\nBecause why tip-toe through life to arrive safely at death\n为什么一生要小心翼翼，为了得以善终吗\n\nI'm on a journey yeah I'm on a roll\n我充满渴望，我势如破竹\n\nSometimes I gotta close my eyes just to open my soul\n有时我闭上双眼，敞开我的魂魄\n\nAnd tonight is the night I gotta feeling I'm about to act a fool\n今晚是时候了，我会细细品味扮演一位愚人\n\nSo if you go fix some drinks me and Usher 'bout to break some rules\n所以如果你为我调一杯饮料Usher我便会干点出格的趣事\n\nThat's somewhere and gone but the world is moving slow\n目的地很明确但世界在不断运动\n\nI was born for the fast life\n我的人生生来完美\n\nI go for broke a lesson I can't afford\n我追求一切不会在此堕落\n\nBut for what it's worth I'm ready to pay\n但是为了更加有意义我已经准备好继续进行\n\nFor the rest of my life\n我的余生\n\nFor the rest of my life\n我的余生\n\nIf I got one life to live I'mma party 'til I'm dead\n如果我能度过一生，我会将聚会进行到底\n\nWhat the hell is a life worth living if it's not on the edge\n如果生活不处于叛逆的边缘活着有什么意思\n\nTrying to keep my balance I'm twisted so just in case I fall\n试着维持劳逸结合，我之所以舞动是为了防止沦落\n\nWritten on my tombstone should say \"Women W**d and Alcohol\"\n在我的墓碑上刻下，女人在抽烟喝酒方面赢了\n\nThat's somewhere and gone but the world is moving slow\n目的地很明确但世界在不断运动\n\nI was born for the fast life\n我的人生生来完美\n\nI go for broke a lesson I can't afford\n我追求一切不会在此堕落\n\nBut for what it's worth I'm ready to pay\n但是为了更加有意义我已经准备好继续进行\n\nFor the rest of my life\n我的余生\n\nFor the rest of my life\n我的余生\n\nIf you live for somethin'\n如果你活的有所理想\n\nYou're not alone my friend\n你就不会孤独，朋友\n\nSo fill up your cup and lift your lighter\n所以通过苦难磨练你自己吧，高举火把\n\nA toast to life\n为了生活干杯\n\nI'm stuck in this moment freeze the hands of time\n我在此刻沉沦，定格忙碌的生活节奏\n\nCause I feel inner peace when I'm out of my mind\n因为我在神游天外时能感受到内心的平静\n\nAnd you can call me crazy but I like to roll the dice\n你可以把我当做疯子但我喜欢掌握自己的命运之骰\n\nSo I'm willing to bet that I'mma be crazy for the rest of my life\n所以我祈求我会在余生疯狂一把，我的余生\n\nFor the rest of my life\n我的余生\n\nFor the rest of my life\n我的余生",
    "path": "/LingChenJiaYou"
  },
  {
    "index": 2,
    "type": "监狱建筑师——游戏攻略",
    "title": "“无供应”问题解决方法",
    "passage": "如图，你可能在游玩时遇到过以下问题\n\n\n\"这个监牢不可以访问食堂\"\n\n＂没有任何囚犯被分配在这个食堂吃饭＂\n通常情况下，造成此类问题的原因是食堂与厨房/牢房的供应链接断开，如果你依次点击菜单中的＂后勤＂，供应后，你会发现如下情况\n\n\n未链接的餐厅\n如图，所有食堂与监区的链接线都消失了，代表此时食堂并没有向任何一个牢房供餐，食堂没有正常工作 此时，请点击“食物分配”，再点击绿色叉子图标后选择“链接”，再点击对应监区来建立食堂对该监区的食物供应\n\n\n如图所示，出现红线即代表连接正确\n再重复此操作，直到将食堂与所有监区建立食物供应，此时问题即可解决",
    "path": "/Prison/Tips/1"
  },
  {
    "index": 3,
    "type": "关于我们",
    "title": "关于我们",
    "passage": "UGCC联盟，致力于服务玩家与各游戏一线开发者，下滑以继续，我们所涉及的游戏：监狱建筑师Prison Architect112接线员112 Operator世界征服者World Conqueror ROBLOX开源共建共享UGCC开源计划我们坚信，开源与共享将是未来各游戏圈子的发展方向，也是促进技术交流与发展的最佳方式。因此，我们将逐步开放由UGCC联盟开发的安装器、工具等项目的源代码，并承诺所有玩家均可无偿使用我们提供的服务，亦或是对其进行修改。开发团队及贡献者\n捏嘿嘿\n溪辰\n狐幽鸣酱\n加入我们\n百闻不如一见，我们正需要你这样热爱游戏与技术的玩家。无论你是萌新亦或大佬，这里都必然有你的用武之地。又或许你只想要解答自己心中埋藏已久的游戏问题，当然可以！我们随时欢迎您的到来！\n监狱建筑师交流群总群丨UGCC\n联盟总群,众多模组的首发地及全联盟最大的玩家交流群\n提取出所有中文监狱建筑师交流群 二群丨UGCC\n联盟二群,拥有热情的玩家以及技术经验丰富的众多大佬监狱建筑师交流群 三群丨UGCC\n联盟三群，萌新玩家聚集地，欢迎前来交流心得监狱建筑师交流群 新特区丨UGCC\n联盟近期加入成员群，管理制度独具特色，成员活跃监狱建筑师交流群 新特区二群丨UGCC\n联盟直属管辖群，技术交流频繁，氛围良好",
    "path": "/About"
  },
  {
    "index": 4,
    "type": "监狱建筑师——游戏攻略",
    "title": "玩忽职守",
    "passage": "当发生大规模暴动或伤亡事件导致局面失去控制时，您将会收到来自首席执行官（CEO）的致电，并收到最后通牒。\n\n\n大规模暴动触发条件\n监狱内伤亡人数过多\n负债过高\n如果您未能在规定时间内控制局势，那么州政府将会介入。其将派遣一支国民警卫队前往您的监狱并对所有正在执行违规行为的囚犯进行无差别射杀\n\n\n州政府的国民警卫队\n您将被判处“玩忽职守”罪并被送上囚车，然后在监牢中度过余生。如果您是电脑版玩家，那么您将有机会体验一次逃出自己亲手建造的监狱！（逃脱模式被强制启动）\n\n解决方法\n在规定时间内完成CEO的要求\n在游戏开始前取消勾选“失败条件”\n避免大规模暴动、瘟疫和负债过多\n在官僚科技树中研究法律辩护(一次性)",
    "path": "/Prison/Tips/WanHuZhiShou"
  },
  {
    "index": 5,
    "type": "开发文档",
    "title": "文档编辑器使用教程",
    "passage": "文档编辑器使用教程\n内容索引>\n注意\n此文档是为本站编辑者编写的教程，玩家无需阅读此文档\nUGCC富文本编辑器\n作为文档开发者，您需要了解并熟练使用本站的富文本编辑器，以创作您的文章。本站的编辑器基于QUILL开发，拥有极佳的可扩展性及丰富的功能，下面我将详细讲解该编辑器的基本功能及使用方法。\n\n布局介绍\n\n请务必注意您的分区！\n当您点击“发布文章”后，您会看到上述界面。您需要事先确定文章所属的分区,并进行正确的选择。该选项将决定您的文章在网站内的哪一栏目下显示。错误的分区将导致您的文章被管理员删除！\n\n\n富文本编辑器\n当您选择完毕后，就会进入上述图片的编辑器界面，编辑器从上至下依次分为三大区域，分别是工具栏，编辑区，设置区。单击编辑区域，看见光标即代表您可以进行写作\n\n工具栏\n\n工具栏\n我将从左至右，从上至下逐一介绍每个工具的用途。如果要将工具的效果套用在文本中，您需要选中文本，然后单击工具栏上的图标。如果您使用过word，那么会很容易上手\n\n加粗：将所选文本加粗\n\n\n加粗效果\n斜体：将所选文本斜体\n\n\n斜体效果\n下划线：在所选文本下方添加下划线\n\n\n下划线效果\n删除线：使一条删除线从中间贯穿文本\n\n\n删除线\n字号：改变字体大小\n\n\nHUGE与normal注意\n其不能代替h1作为文章标题或代替h1,h2的语义，这在下文会有所提及\n字体：改变字体\n\n\n不同的预设字体\n对齐：改变文章段落对齐方式\n\n注意\n其只能作为编辑时的参考，最终渲染出的文章样式会有所差异\n\n从上至下依次为左对齐，居中对齐，右对齐，默认对齐\n有序列表：以数字开头逐项列出的有序列表，换行自动补全数字\n\n\n有序列表\n无序列表：以实心圆开头逐项列出的无序列表，换行自动补全实心圆\n\n\n无序列表\n上下角标：主要用于数学/物理公式的表示\n\n\n下角标与上角标\n左/右缩进：快速向左/右打出四个空格以缩进文本\n\nH1标题（一级标题）：用于文章的总标题或文章内部的章节标题，请务必使用h1作为文章的第一行（标题）\n\n非常重要\n所有文章的第一行都应该是H1标题，其将被作为文章的标题，如果没有将无法提交。并且其内部不能含有诸如<>这类非法字符（防止脚本注入攻击）\n\n一级标题\nH2标题（二级标题）：与一级标题大致相同，但不会被识别为文章的总标题，字号略小\n\n\n二级标题\n超链接文本：选中文本后使用，输入链接后该文本可被点击，将当前页面跳转至一个新的链接（为防止CSRF攻击，可用的url仅限站内链接）\n\n\n超链接文本\n插入图片：在当前光标的位置插入一张图片，同时设置图片的描述（如果有的话）\n\n提示\n如果您需要设置图片的描述，请确保您的光标位于该图片上（或直接长按选中图片），然后点击设置区的“设置图片描述”按钮，输入对应内容即可\n\n插入图片\n改变光标位置：极其不推荐使用（反人类的抽象功能）\n\n改变文字颜色：提供35种不同的文本颜色来帮您构建彩色文字\n\n\n彩色文字\n\n调色盘\n设置文字背景颜色：可以达到类似于荧光笔的效果\n\n\n彩色背景的文字\n代码块：支持多种主流编程语言的代码块，提供语法高亮\n\n\n代码块\n引用块：提供语义化的引用样式块\n\n\n引用块\n数学表达式:编写数学公式\n该功能已被禁用\n\n编辑区\n该区域用于编辑文章内容，您的光标所指位置即为当前工具效果会应用到的位置。需要注意的是，编辑区的第一行一定要以h1标题开头，其将作为整篇文章的标题！\n\n\n编辑区\n设置区\n该区域由两个按钮组成，“设置图片描述”用于设置光标所指（选中）位置图片的描述，其渲染效果如下\n\n\n图片与描述\n而当一切准备就绪且检查无误后，您可以点击\"提交\"按钮将您的文章发布至服务器，我们将把您的文章展示在对应栏目下。发布成功后，您可以在“管理文章”选项中找到并管理您的文章，您需要注意以下几点：\n\n非常重要\n本网站中的“修改”实际上是覆写，如果要修改您的文章，您要先复制原文，保存对应图片后点击铅笔图标，对原文章进行覆盖。您的文章ID将保持不变\n如果您想删除文章，您可以点击删除按钮，但请注意，删除操作是不可逆的！\n最后，我（捏嘿嘿）代表UGCC联盟网站制作组及游戏开发组预祝您创作顺利，并感谢您对圈子作出的贡献！",
    "path": "/Dev/editorTutorial"
  },
  {
    "index": 6,
    "type": "监狱建筑师——游戏攻略",
    "title": "监狱建筑师章节教程及攻略by死刑犯章节",
    "passage": "剧情1(死刑犯)攻略及指导：\n\n()为注释\n\n{*}为可忽略情节\n\n#为必要情节\n\n#首先，进入剧情后过一小段动画(可以直接跳过)，之后CEO会让你建造行刑室，你需要按照他的指导一步一步来，\n\n#首先点击右下角的图标(可以叫他工具栏)，然后点击第一个地基，选择建材，{*可以用混凝土，纯净美观}，选择好后点击CEO指定区域的左上角，然后拖拽至右下角，点击✔️后，点击工具栏的物品，选择大监狱门，拖拽至CEO指定区域，等待工人建造，建造完成后进行对话\n\n#第二步，进行内部布置，{*这里的红砖墙可以用混凝土墙代替}，点工具栏的建材，选择墙(任意一种墙)，然后点击拖拽直到把所有需要墙的地方填满，之后使用大型监狱门将墙体中间的地方补上\n\n#第三步，进行规划与物品放置，完成对话后可以点击工具栏的房间，找到行刑室，给最上面的房间规划行刑室，然后找到牢房，给左下角的房间规划牢房(注：门上不能规划，不然会显示不封闭)，完成好后放置物品\n\n#点击工具栏的物品，点击床，放置在该放置床的地方{*别告诉我你这都不会}放好后放置厕所{*什么汉化啊，不是马桶吗}放置好后放置电椅在行刑室\n\n又是一段对话{*这CEO的A+1话怎么这么多}，过完对话后按照CEO的指示进行装饰，然后CEO就会启动电椅，这时候发现，电站的电量不够，导致跳闸，这时候需要放置电容器\n\n电容器在工具栏的公共设施里面，找到电容器放在指定区域\n\n#放完后还不够，还需要连接电缆，同样在公共设施里面，你需要点击并拖拽到指定位置\n\n\n\n\n\n如图所示，连接完后多连接一条至牢房\n\n之后事半功倍，需要过一段很yellow的剧情，建议大家🧷跳过\n\n之后就是过剧情过剧情，一次次一次次一次又一次，这老逼登有说不完的话，过完所有的剧情之后这个章节也算完成了\n这里是小集，我们下期再见，bye",
    "path": "/Articles/Prison/playerTips/1725029586"
  },
  {
    "index": 7,
    "type": "监狱建筑师——游戏攻略",
    "title": "士兵",
    "passage": "国民警卫队(Soldiers)，是由4~8个士兵(Soldier)组成的反恐防暴机构，通常是乘坐运兵车(TroopTruck)，他们通常持有致命器械突击步枪(AssaultRifle)，通过攻击的方式让囚犯(Prisoner)投降\n\n\nScreenshot_20240830_231551_com.paradoxplaza.prisonarchitect.jpg\n如图，基础原版的是4人队，改版会有一个首领带领\n\n                                    ——不息的小集by UGCC",
    "path": "/Articles/Prison/playerTips/1725084324"
  },
  {
    "index": 8,
    "type": "监狱建筑师——游戏攻略",
    "title": "牢房与宿舍",
    "passage": "许多玩家在游玩时会遇到宿舍，牢房的选择，但苦于不知两者的区别，下面让我做出解释。\n\n       牢房是一个单独的个体，里面仅能容纳1名囚犯，最小空间为6平米（注：实行小牢房政策除外）可以较好保护囚犯的隐私，单价相对昂贵，下图为推荐（约1440元/间）\n\n\n牢房推荐\n        而宿舍则可容纳多名囚犯，最大容量由面积决定，一囚犯需4平米空间，但是隐私不能较好的满足 ，可能发生斗殴，性价比较高，适合资金缺少时使用，建议用双人床下图为推荐（约2660元/间）平均665元/人，综上所述宿舍价格更低，可随个人需求调证物品摆放。\n\n\n宿舍推荐\n         好了以上就是全部内容，感谢观看！\n\n                                                                                                                                                                                                                                                                                                                                                             编写人：折柳（3680153834）\n\n                                                                                                                                                                                                                                                                                                                                                            最后修改时间：2024年9月15日\n\n",
    "path": "/Articles/Prison/playerTips/1726373112"
  },
  {
    "index": 9,
    "type": "监狱建筑师——游戏攻略",
    "title": "水电的使用",
    "passage": "电站是监狱中维护电力的重要设施，以下是一些主意事项\n\n电站具有发电量，发电量越高可支持的设施越多，发电量由电容器的数量有关，电容器仅在电站外侧一圈有效，最多可安置16个。若超过发电量，则会跳闸，可增加电站数量，同时电站之间不能相连，不然会断电，电站在遇水后会漏电着火（可以想想其他作用😈）\n\n\n电站最高级\n水汞站的使用：它只需连接电力即可使用，通过水管将水分配到各地，有些玩家在游玩时会遇到以下情况（图1.0），这种情况是因为水压不足。小水管水压小（最长供给39米），大水管压强大（距离可视为无限）其中烘暖的热水管道水压相当于小水管。\n\n以上是本篇内容，谢谢观看！\n\n                                                                                                                                                             \n\n\n图1.0\n                                                                                                                                                                               \n                                                                                                                                                                                                                                                                                                                      编写人：折柳（3680153834）\n\n                                                                                                                                                                                                                                                                                                                                              修改日期：2024年9月15日\n\n",
    "path": "/Articles/Prison/playerTips/1726379006"
  },
  {
    "index": 10,
    "type": "112接线员——游戏攻略",
    "title": "单位部署",
    "passage": "单位部署\n\n单位应当均匀部署在任务区域内，如图所示。\n\n\n散白Ming的值班部署截图\n通常来说，城市区域的部署密度应当大于乡村区域的部署密度；\n警察单位的部署密度应当大于\n医疗及消防单位的部署密度。\n",
    "path": "/Articles/Operator/OperatorTips/1726315499"
  },
  {
    "index": 11,
    "type": "112接线员——游戏攻略",
    "title": "人员",
    "passage": "人员\n\n1.人员属性\n\n2.人员伤亡\n\n有意思的是，虽然在普通警务事件中，嫌犯不会攻击医疗或消防人员，但是在丧尸事件中，丧尸会攻击医疗或消防人员，只有一个事件例外。在防守无感染区事件中，丧尸不会攻击医疗或消防人员。\n\n3.人员攻击\n\n红点和白长点\n\n医疗或消防人员在普通警务事件中遇到攻击性嫌犯时，他们会待在车上使嫌犯无法攻击他们。但医疗或消防人员在丧尸事件中遇到丧尸时，他们会主动下车攻击丧尸，并因此受伤。\n\n本文作者:sanbai\n最后编辑日期：Sun Sep 15 2024",
    "path": "/Articles/Operator/OperatorTips/1726381072"
  },
  {
    "index": 12,
    "type": "112接线员——游戏攻略",
    "title": "装备",
    "passage": "装备\n\n说起来可能有点令人失望，但是在游戏中，只有警务人员的装备对事件的处理有决定性的影响。换句话说，医疗和消防人员无论配备什么装备都只影响他们处理事件的快慢，而不影响他们是否能处理事件。因此，我仅给出配备医疗或消防人员装备的建议并着重讨论如何配备警务人员的装备。\n\n",
    "path": "/Articles/Operator/OperatorTips/1726381533"
  }
]